PART 1 : IMPLEMENTATION OF LOGISTIC REGRESSION

In [19]:
import numpy as np # linear algebra
import pandas as pd

In [20]:
raw_data = pd.read_csv("C://Users//praty//2th sem Machine learning//log reg and knn//Social_Network_Ads.csv")
raw_data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [21]:
raw_data.describe(include= "all")

             User ID  Gender         Age  EstimatedSalary   Purchased
count   4.000000e+02     400  400.000000       400.000000  400.000000
unique           NaN       2         NaN              NaN         NaN
top              NaN  Female         NaN              NaN         NaN
freq             NaN     204         NaN              NaN         NaN
mean    1.569154e+07     NaN   37.655000     69742.500000    0.357500
std     7.165832e+04     NaN   10.482877     34096.960282    0.479864
min     1.556669e+07     NaN   18.000000     15000.000000    0.000000
25%     1.562676e+07     NaN   29.750000     43000.000000    0.000000
50%     1.569434e+07     NaN   37.000000     70000.000000    0.000000
75%     1.575036e+07     NaN   46.000000     88000.000000    1.000000
max     1.581524e+07     NaN   60.000000    150000.000000    1.000000

In [5]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [22]:
raw_data.isna().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [23]:
#We can drop "User ID" feature and convert male to 0 and female to 1
raw_data.drop(["User ID"], axis = 1, inplace = True)
raw_data.replace({"Gender":{"Male":0,"Female":1}}, inplace = True)
raw_data.head()

   Gender  Age  EstimatedSalary  Purchased
0       0   19            19000          0
1       0   35            20000          0
2       1   26            43000          0
3       1   27            57000          0
4       0   19            76000          0

In [24]:
X = raw_data.drop(["Purchased"], axis = 1)
y = raw_data.Purchased

In [25]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state = 42)

In [26]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test  = scaler.fit_transform(X_test)

In [27]:
from sklearn.linear_model import LogisticRegression

Log_Reg = LogisticRegression()

Log_Reg.fit(X_train, y_train)

LogisticRegression()

In [28]:
Log_Reg.score(X_test, y_test)

0.875

In [29]:
predictions = Log_Reg.predict(X_test)
from sklearn.metrics import classification_report
print(classification_report(y_test, predictions))

              precision    recall  f1-score   support

           0       0.88      0.94      0.91        52
           1       0.88      0.75      0.81        28

    accuracy                           0.88        80
   macro avg       0.88      0.85      0.86        80
weighted avg       0.88      0.88      0.87        80

In [31]:
from sklearn.metrics import confusion_matrix
confusion_matrix(y_test,predictions)

array([[49,  3],
       [ 7, 21]], dtype=int64)

In [ ]:
#END OF REPORT